SixmonB/TDS/tds/_Libraries/STM32F4xx_HAL_Driver/Inc/stm32f4xx_std_dma.h
/** @defgroup DMA_flags_definition
  * @{
  */
#define DMA_FLAG_FEIF0                    ((uint32_t)0x10800001)
#define DMA_FLAG_DMEIF0                   ((uint32_t)0x10800004)
#define DMA_FLAG_TEIF0                    ((uint32_t)0x10000008)
#define DMA_FLAG_HTIF0                    ((uint32_t)0x10000010)
#define DMA_FLAG_TCIF0                    ((uint32_t)0x10000020)
#define DMA_FLAG_FEIF1                    ((uint32_t)0x10000040)
#define DMA_FLAG_DMEIF1                   ((uint32_t)0x10000100)
#define DMA_FLAG_TEIF1                    ((uint32_t)0x10000200)
#define DMA_FLAG_HTIF1                    ((uint32_t)0x10000400)
#define DMA_FLAG_TCIF1                    ((uint32_t)0x10000800)
#define DMA_FLAG_FEIF2                    ((uint32_t)0x10010000)
#define DMA_FLAG_DMEIF2                   ((uint32_t)0x10040000)
#define DMA_FLAG_TEIF2                    ((uint32_t)0x10080000)
#define DMA_FLAG_HTIF2                    ((uint32_t)0x10100000)
#define DMA_FLAG_TCIF2                    ((uint32_t)0x10200000)
#define DMA_FLAG_FEIF3                    ((uint32_t)0x10400000)
#define DMA_FLAG_DMEIF3                   ((uint32_t)0x11000000)
#define DMA_FLAG_TEIF3                    ((uint32_t)0x12000000)
#define DMA_FLAG_HTIF3                    ((uint32_t)0x14000000)
#define DMA_FLAG_TCIF3                    ((uint32_t)0x18000000)
#define DMA_FLAG_FEIF4                    ((uint32_t)0x20000001)
#define DMA_FLAG_DMEIF4                   ((uint32_t)0x20000004)
#define DMA_FLAG_TEIF4                    ((uint32_t)0x20000008)
#define DMA_FLAG_HTIF4                    ((uint32_t)0x20000010)
#define DMA_FLAG_TCIF4                    ((uint32_t)0x20000020)
#define DMA_FLAG_FEIF5                    ((uint32_t)0x20000040)
#define DMA_FLAG_DMEIF5                   ((uint32_t)0x20000100)
#define DMA_FLAG_TEIF5                    ((uint32_t)0x20000200)
#define DMA_FLAG_HTIF5                    ((uint32_t)0x20000400)
#define DMA_FLAG_TCIF5                    ((uint32_t)0x20000800)
#define DMA_FLAG_FEIF6                    ((uint32_t)0x20010000)
#define DMA_FLAG_DMEIF6                   ((uint32_t)0x20040000)
#define DMA_FLAG_TEIF6                    ((uint32_t)0x20080000)
#define DMA_FLAG_HTIF6                    ((uint32_t)0x20100000)
#define DMA_FLAG_TCIF6                    ((uint32_t)0x20200000)
#define DMA_FLAG_FEIF7                    ((uint32_t)0x20400000)
#define DMA_FLAG_DMEIF7                   ((uint32_t)0x21000000)
#define DMA_FLAG_TEIF7                    ((uint32_t)0x22000000)
#define DMA_FLAG_HTIF7                    ((uint32_t)0x24000000)
#define DMA_FLAG_TCIF7                    ((uint32_t)0x28000000)

#define IS_DMA_CLEAR_FLAG(FLAG) ((((FLAG) & 0x30000000) != 0x30000000) && (((FLAG) & 0x30000000) != 0) && \
                                 (((FLAG) & 0xC082F082) == 0x00) && ((FLAG) != 0x00))

#define IS_DMA_GET_FLAG(FLAG) (((FLAG) == DMA_FLAG_TCIF0)  || ((FLAG) == DMA_FLAG_HTIF0)  || \
                               ((FLAG) == DMA_FLAG_TEIF0)  || ((FLAG) == DMA_FLAG_DMEIF0) || \
                               ((FLAG) == DMA_FLAG_FEIF0)  || ((FLAG) == DMA_FLAG_TCIF1)  || \
                               ((FLAG) == DMA_FLAG_HTIF1)  || ((FLAG) == DMA_FLAG_TEIF1)  || \
                               ((FLAG) == DMA_FLAG_DMEIF1) || ((FLAG) == DMA_FLAG_FEIF1)  || \
                               ((FLAG) == DMA_FLAG_TCIF2)  || ((FLAG) == DMA_FLAG_HTIF2)  || \
                               ((FLAG) == DMA_FLAG_TEIF2)  || ((FLAG) == DMA_FLAG_DMEIF2) || \
                               ((FLAG) == DMA_FLAG_FEIF2)  || ((FLAG) == DMA_FLAG_TCIF3)  || \
                               ((FLAG) == DMA_FLAG_HTIF3)  || ((FLAG) == DMA_FLAG_TEIF3)  || \
                               ((FLAG) == DMA_FLAG_DMEIF3) || ((FLAG) == DMA_FLAG_FEIF3)  || \
                               ((FLAG) == DMA_FLAG_TCIF4)  || ((FLAG) == DMA_FLAG_HTIF4)  || \
                               ((FLAG) == DMA_FLAG_TEIF4)  || ((FLAG) == DMA_FLAG_DMEIF4) || \
                               ((FLAG) == DMA_FLAG_FEIF4)  || ((FLAG) == DMA_FLAG_TCIF5)  || \
                               ((FLAG) == DMA_FLAG_HTIF5)  || ((FLAG) == DMA_FLAG_TEIF5)  || \
                               ((FLAG) == DMA_FLAG_DMEIF5) || ((FLAG) == DMA_FLAG_FEIF5)  || \
                               ((FLAG) == DMA_FLAG_TCIF6)  || ((FLAG) == DMA_FLAG_HTIF6)  || \
                               ((FLAG) == DMA_FLAG_TEIF6)  || ((FLAG) == DMA_FLAG_DMEIF6) || \
                               ((FLAG) == DMA_FLAG_FEIF6)  || ((FLAG) == DMA_FLAG_TCIF7)  || \
                               ((FLAG) == DMA_FLAG_HTIF7)  || ((FLAG) == DMA_FLAG_TEIF7)  || \
                               ((FLAG) == DMA_FLAG_DMEIF7) || ((FLAG) == DMA_FLAG_FEIF7))
/**
  * @}
  */


/** @defgroup DMA_interrupt_enable_definitions
  * @{
  */
#define DMA_IT_TC_STD                         ((uint32_t)0x00000010)
#define DMA_IT_HT_STD                         ((uint32_t)0x00000008)
#define DMA_IT_TE_STD                         ((uint32_t)0x00000004)
#define DMA_IT_DME_STD                        ((uint32_t)0x00000002)
#define DMA_IT_FE_STD                         ((uint32_t)0x00000080)

#define IS_DMA_CONFIG_IT(IT) ((((IT) & 0xFFFFFF61) == 0x00) && ((IT) != 0x00))
/**
  * @}
  */


/** @defgroup DMA_interrupts_definitions
  * @{
  */
#define DMA_IT_FE_STDIF0                      ((uint32_t)0x90000001)
#define DMA_IT_DME_STDIF0                     ((uint32_t)0x10001004)
#define DMA_IT_TE_STDIF0                      ((uint32_t)0x10002008)
#define DMA_IT_HT_STDIF0                      ((uint32_t)0x10004010)
#define DMA_IT_TC_STDIF0                      ((uint32_t)0x10008020)
#define DMA_IT_FE_STDIF1                      ((uint32_t)0x90000040)
#define DMA_IT_DME_STDIF1                     ((uint32_t)0x10001100)
#define DMA_IT_TE_STDIF1                      ((uint32_t)0x10002200)
#define DMA_IT_HT_STDIF1                      ((uint32_t)0x10004400)
#define DMA_IT_TC_STDIF1                      ((uint32_t)0x10008800)
#define DMA_IT_FE_STDIF2                      ((uint32_t)0x90010000)
#define DMA_IT_DME_STDIF2                     ((uint32_t)0x10041000)
#define DMA_IT_TE_STDIF2                      ((uint32_t)0x10082000)
#define DMA_IT_HT_STDIF2                      ((uint32_t)0x10104000)
#define DMA_IT_TC_STDIF2                      ((uint32_t)0x10208000)
#define DMA_IT_FE_STDIF3                      ((uint32_t)0x90400000)
#define DMA_IT_DME_STDIF3                     ((uint32_t)0x11001000)
#define DMA_IT_TE_STDIF3                      ((uint32_t)0x12002000)
#define DMA_IT_HT_STDIF3                      ((uint32_t)0x14004000)
#define DMA_IT_TC_STDIF3                      ((uint32_t)0x18008000)
#define DMA_IT_FE_STDIF4                      ((uint32_t)0xA0000001)
#define DMA_IT_DME_STDIF4                     ((uint32_t)0x20001004)
#define DMA_IT_TE_STDIF4                      ((uint32_t)0x20002008)
#define DMA_IT_HT_STDIF4                      ((uint32_t)0x20004010)
#define DMA_IT_TC_STDIF4                      ((uint32_t)0x20008020)
#define DMA_IT_FE_STDIF5                      ((uint32_t)0xA0000040)
#define DMA_IT_DME_STDIF5                     ((uint32_t)0x20001100)
#define DMA_IT_TE_STDIF5                      ((uint32_t)0x20002200)
#define DMA_IT_HT_STDIF5                      ((uint32_t)0x20004400)
#define DMA_IT_TC_STDIF5                      ((uint32_t)0x20008800)
#define DMA_IT_FE_STDIF6                      ((uint32_t)0xA0010000)
#define DMA_IT_DME_STDIF6                     ((uint32_t)0x20041000)
#define DMA_IT_TE_STDIF6                      ((uint32_t)0x20082000)
#define DMA_IT_HT_STDIF6                      ((uint32_t)0x20104000)
#define DMA_IT_TC_STDIF6                      ((uint32_t)0x20208000)
#define DMA_IT_FE_STDIF7                      ((uint32_t)0xA0400000)
#define DMA_IT_DME_STDIF7                     ((uint32_t)0x21001000)
#define DMA_IT_TE_STDIF7                      ((uint32_t)0x22002000)
#define DMA_IT_HT_STDIF7                      ((uint32_t)0x24004000)
#define DMA_IT_TC_STDIF7                      ((uint32_t)0x28008000)

#define IS_DMA_CLEAR_IT(IT) ((((IT) & 0x30000000) != 0x30000000) && \
                             (((IT) & 0x30000000) != 0) && ((IT) != 0x00) && \
                             (((IT) & 0x40820082) == 0x00))

