SixmonB/TDS/tds/_Libraries/STM32F4xx_HAL_Driver/Inc/stm32f4xx_std_dma.h
#define IS_DMA_GET_IT(IT) (((IT) == DMA_IT_TC_STDIF0) || ((IT) == DMA_IT_HT_STDIF0)  || \
                           ((IT) == DMA_IT_TE_STDIF0) || ((IT) == DMA_IT_DME_STDIF0) || \
                           ((IT) == DMA_IT_FE_STDIF0) || ((IT) == DMA_IT_TC_STDIF1)  || \
                           ((IT) == DMA_IT_HT_STDIF1) || ((IT) == DMA_IT_TE_STDIF1)  || \
                           ((IT) == DMA_IT_DME_STDIF1)|| ((IT) == DMA_IT_FE_STDIF1)  || \
                           ((IT) == DMA_IT_TC_STDIF2) || ((IT) == DMA_IT_HT_STDIF2)  || \
                           ((IT) == DMA_IT_TE_STDIF2) || ((IT) == DMA_IT_DME_STDIF2) || \
                           ((IT) == DMA_IT_FE_STDIF2) || ((IT) == DMA_IT_TC_STDIF3)  || \
                           ((IT) == DMA_IT_HT_STDIF3) || ((IT) == DMA_IT_TE_STDIF3)  || \
                           ((IT) == DMA_IT_DME_STDIF3)|| ((IT) == DMA_IT_FE_STDIF3)  || \
                           ((IT) == DMA_IT_TC_STDIF4) || ((IT) == DMA_IT_HT_STDIF4)  || \
                           ((IT) == DMA_IT_TE_STDIF4) || ((IT) == DMA_IT_DME_STDIF4) || \
                           ((IT) == DMA_IT_FE_STDIF4) || ((IT) == DMA_IT_TC_STDIF5)  || \
                           ((IT) == DMA_IT_HT_STDIF5) || ((IT) == DMA_IT_TE_STDIF5)  || \
                           ((IT) == DMA_IT_DME_STDIF5)|| ((IT) == DMA_IT_FE_STDIF5)  || \
                           ((IT) == DMA_IT_TC_STDIF6) || ((IT) == DMA_IT_HT_STDIF6)  || \
                           ((IT) == DMA_IT_TE_STDIF6) || ((IT) == DMA_IT_DME_STDIF6) || \
                           ((IT) == DMA_IT_FE_STDIF6) || ((IT) == DMA_IT_TC_STDIF7)  || \
                           ((IT) == DMA_IT_HT_STDIF7) || ((IT) == DMA_IT_TE_STDIF7)  || \
                           ((IT) == DMA_IT_DME_STDIF7)|| ((IT) == DMA_IT_FE_STDIF7))
/**
  * @}
  */


/** @defgroup DMA_peripheral_increment_offset
  * @{
  */
#define DMA_PINCOS_Psize                  ((uint32_t)0x00000000)
#define DMA_PINCOS_WordAligned            ((uint32_t)0x00008000)

#define IS_DMA_PINCOS_SIZE(SIZE) (((SIZE) == DMA_PINCOS_Psize) || \
                                  ((SIZE) == DMA_PINCOS_WordAligned))
/**
  * @}
  */


/** @defgroup DMA_flow_controller_definitions
  * @{
  */
#define DMA_FlowCtrl_Memory               ((uint32_t)0x00000000)
#define DMA_FlowCtrl_Peripheral           ((uint32_t)0x00000020)

#define IS_DMA_FLOW_CTRL(CTRL) (((CTRL) == DMA_FlowCtrl_Memory) || \
                                ((CTRL) == DMA_FlowCtrl_Peripheral))
/**
  * @}
  */


/** @defgroup DMA_memory_targets_definitions
  * @{
  */
#define DMA_Memory_0                      ((uint32_t)0x00000000)
#define DMA_Memory_1                      ((uint32_t)0x00080000)

#define IS_DMA_CURRENT_MEM(MEM) (((MEM) == DMA_Memory_0) || ((MEM) == DMA_Memory_1))
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/*  Function used to set the DMA configuration to the default reset state *****/
void DMA_DeInit(DMA_Stream_TypeDef* DMAy_Streamx);

/* Initialization and Configuration functions *********************************/
void DMA_Init(DMA_Stream_TypeDef* DMAy_Streamx, DMA_std_InitTypeDef* DMA_InitStruct);
void DMA_StructInit(DMA_std_InitTypeDef* DMA_InitStruct);
void DMA_Cmd(DMA_Stream_TypeDef* DMAy_Streamx, FunctionalState NewState);

/* Optional Configuration functions *******************************************/
void DMA_PeriphIncOffsetSizeConfig(DMA_Stream_TypeDef* DMAy_Streamx, uint32_t DMA_Pincos);
void DMA_FlowControllerConfig(DMA_Stream_TypeDef* DMAy_Streamx, uint32_t DMA_FlowCtrl);

/* Data Counter functions *****************************************************/
void DMA_SetCurrDataCounter(DMA_Stream_TypeDef* DMAy_Streamx, uint16_t Counter);
uint16_t DMA_GetCurrDataCounter(DMA_Stream_TypeDef* DMAy_Streamx);

/* Double Buffer mode functions ***********************************************/
void DMA_DoubleBufferModeConfig(DMA_Stream_TypeDef* DMAy_Streamx, uint32_t Memory1BaseAddr,
                                uint32_t DMA_CurrentMemory);
void DMA_DoubleBufferModeCmd(DMA_Stream_TypeDef* DMAy_Streamx, FunctionalState NewState);
void DMA_MemoryTargetConfig(DMA_Stream_TypeDef* DMAy_Streamx, uint32_t MemoryBaseAddr,
                            uint32_t DMA_MemoryTarget);
uint32_t DMA_GetCurrentMemoryTarget(DMA_Stream_TypeDef* DMAy_Streamx);

/* Interrupts and flags management functions **********************************/
FunctionalState DMA_GetCmdStatus(DMA_Stream_TypeDef* DMAy_Streamx);
uint32_t DMA_GetFIFOStatus(DMA_Stream_TypeDef* DMAy_Streamx);
FlagStatus DMA_GetFlagStatus(DMA_Stream_TypeDef* DMAy_Streamx, uint32_t DMA_FLAG);
void DMA_ClearFlag(DMA_Stream_TypeDef* DMAy_Streamx, uint32_t DMA_FLAG);
void DMA_ITConfig(DMA_Stream_TypeDef* DMAy_Streamx, uint32_t DMA_IT, FunctionalState NewState);
ITStatus DMA_GetITStatus(DMA_Stream_TypeDef* DMAy_Streamx, uint32_t DMA_IT);
void DMA_ClearITPendingBit(DMA_Stream_TypeDef* DMAy_Streamx, uint32_t DMA_IT);

#ifdef __cplusplus
}
#endif



/**
  * @}
  */

/**
  * @}
  */


/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/



#endif /* LIBRARIES_STM32F4XX_HAL_DRIVER_INC_STM32F4XX_STD_DMA_H_ */
